; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain mailrun)
    (:types
        hamlet scroll satchel courier - object
    )
    (:predicates
        (posted-at ?b - courier ?x - hamlet)
        (resting ?i - scroll ?x - hamlet)
        (road ?x - hamlet ?y - hamlet)
        (idle ?a - satchel)
        (held-in ?i - scroll ?a - satchel)
        (stowed-in ?i - scroll ?b - courier)
        (attached ?a - satchel ?b - courier)
    )

    (:functions
        (pouch_limit ?b - courier)
        (current_pouch ?b - courier)
        (mass ?i - scroll)
        (toll)
    )

    (:action ride
        :parameters (?b - courier ?x - hamlet ?y - hamlet)
        :precondition (and (posted-at ?b ?x)
            (road ?x ?y))
        :effect (and (posted-at ?b ?y)
            (not (posted-at ?b ?x))
            (increase (toll) 3)
        )
    )

    (:action grab
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (resting ?i ?x) (posted-at ?b ?x) (idle ?a) (attached ?a ?b)
            (<= (+ (current_pouch ?b) (mass ?i)) (pouch_limit ?b)))
        :effect (and (held-in ?i ?a)
            (not (resting ?i ?x))
            (not (idle ?a))
            (increase (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action place
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (posted-at ?b ?x)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (resting ?i ?x)
            (not (held-in ?i ?a))
            (decrease (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action to-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (not (held-in ?i ?a))
            (stowed-in ?i ?b)
            (increase (toll) 1)
        )
    )

    (:action from-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (stowed-in ?i ?b)
            (attached ?a ?b)
            (idle ?a))
        :effect (and (not (idle ?a))
            (held-in ?i ?a)
            (not (stowed-in ?i ?b))
            (increase (toll) 1)
        )
    )
)

; problem
(define (problem mailrun-p05)
   (:domain mailrun)
   (:objects hamleta hamletb hamletc - hamlet
             scroll12 scroll11 scroll10
             scroll9 scroll8 scroll7 scroll6 scroll5 scroll4 scroll3 scroll2 scroll1 - scroll
             courier1 courier2 - courier
             leftstrap1 rightstrap1 leftstrap2 rightstrap2 - satchel)
   (:init (= (mass scroll12) 2)
          (= (mass scroll11) 2)
          (= (mass scroll10) 1)
          (= (mass scroll9) 1)
          (= (mass scroll8) 1)
          (= (mass scroll7) 1)
          (= (mass scroll6) 2)
          (= (mass scroll5) 2)
          (= (mass scroll4) 1)
          (= (mass scroll3) 1)
          (= (mass scroll2) 1)
          (= (mass scroll1) 1)

          (resting scroll12 hamleta)
          (resting scroll11 hamleta)
          (resting scroll10 hamleta)
          (resting scroll9 hamleta)
          (resting scroll8 hamleta)
          (resting scroll7 hamleta)
          (resting scroll6 hamleta)
          (resting scroll5 hamleta)
          (resting scroll4 hamleta)
          (resting scroll3 hamleta)
          (resting scroll2 hamleta)
          (resting scroll1 hamleta)

          (posted-at courier1 hamleta)
          (posted-at courier2 hamleta)
          (idle leftstrap1)
          (idle rightstrap1)
          (idle leftstrap2)
          (idle rightstrap2)
          (attached leftstrap1 courier1)
          (attached rightstrap1 courier1)
          (attached leftstrap2 courier2)
          (attached rightstrap2 courier2)

          (road hamleta hamletb)
          (road hamletb hamleta)
          (road hamleta hamletc)
          (road hamletc hamleta)

          (= (current_pouch courier1) 0)
          (= (pouch_limit courier1) 4)
          (= (current_pouch courier2) 0)
          (= (pouch_limit courier2) 4)
          (= (toll) 0)
          )
   (:goal (and (resting scroll12 hamletb)
               (resting scroll11 hamletb)
               (resting scroll10 hamletb)
               (resting scroll9 hamletb)
               (resting scroll8 hamletb)
               (resting scroll7 hamletb)
               (resting scroll6 hamletc)
               (resting scroll5 hamletc)
               (resting scroll4 hamletc)
               (resting scroll3 hamletc)
               (resting scroll2 hamletc)
               (resting scroll1 hamletc)))

               (:metric minimize (toll))

)

; plan
1. (grab scroll4 hamleta rightstrap2 courier2)
   deleted: (resting scroll4 hamleta) (idle rightstrap2)
   added: (held-in scroll4 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 0 to 2
   goals met: 0 of 12
2. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 2 to 5
   goals met: 0 of 12
3. (grab scroll3 hamleta leftstrap1 courier1)
   deleted: (resting scroll3 hamleta) (idle leftstrap1)
   added: (held-in scroll3 leftstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 5 to 7
   goals met: 0 of 12
4. (place scroll4 hamletc rightstrap2 courier2)
   deleted: (held-in scroll4 rightstrap2)
   added: (idle rightstrap2) (resting scroll4 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 7 to 9
   goals met: 1 of 12
5. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 9 to 12
   goals met: 1 of 12
6. (ride courier1 hamleta hamletc)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletc)
   changed: (toll) from 12 to 15
   goals met: 1 of 12
7. (grab scroll5 hamleta rightstrap2 courier2)
   deleted: (resting scroll5 hamleta) (idle rightstrap2)
   added: (held-in scroll5 rightstrap2)
   changed: (current_pouch courier2) from 0 to 2, (toll) from 15 to 17
   goals met: 1 of 12
8. (place scroll3 hamletc leftstrap1 courier1)
   deleted: (held-in scroll3 leftstrap1)
   added: (idle leftstrap1) (resting scroll3 hamletc)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 17 to 19
   goals met: 2 of 12
9. (ride courier1 hamletc hamleta)
   deleted: (posted-at courier1 hamletc)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 19 to 22
   goals met: 2 of 12
10. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 22 to 25
   goals met: 2 of 12
11. (grab scroll2 hamleta leftstrap1 courier1)
   deleted: (resting scroll2 hamleta) (idle leftstrap1)
   added: (held-in scroll2 leftstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 25 to 27
   goals met: 2 of 12
12. (place scroll5 hamletc rightstrap2 courier2)
   deleted: (held-in scroll5 rightstrap2)
   added: (idle rightstrap2) (resting scroll5 hamletc)
   changed: (current_pouch courier2) from 2 to 0, (toll) from 27 to 29
   goals met: 3 of 12
13. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 29 to 32
   goals met: 3 of 12
14. (ride courier1 hamleta hamletc)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletc)
   changed: (toll) from 32 to 35
   goals met: 3 of 12
15. (grab scroll6 hamleta rightstrap2 courier2)
   deleted: (resting scroll6 hamleta) (idle rightstrap2)
   added: (held-in scroll6 rightstrap2)
   changed: (current_pouch courier2) from 0 to 2, (toll) from 35 to 37
   goals met: 3 of 12
16. (place scroll2 hamletc leftstrap1 courier1)
   deleted: (held-in scroll2 leftstrap1)
   added: (idle leftstrap1) (resting scroll2 hamletc)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 37 to 39
   goals met: 4 of 12
17. (ride courier1 hamletc hamleta)
   deleted: (posted-at courier1 hamletc)
   added: (posted-at courier1 hamleta)
   changed: (toll) from 39 to 42
   goals met: 4 of 12
18. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 42 to 45
   goals met: 4 of 12
19. (grab scroll1 hamleta leftstrap1 courier1)
   deleted: (resting scroll1 hamleta) (idle leftstrap1)
   added: (held-in scroll1 leftstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 45 to 47
   goals met: 4 of 12
20. (place scroll6 hamletc rightstrap2 courier2)
   deleted: (held-in scroll6 rightstrap2)
   added: (idle rightstrap2) (resting scroll6 hamletc)
   changed: (current_pouch courier2) from 2 to 0, (toll) from 47 to 49
   goals met: 5 of 12
21. (ride courier2 hamletc hamleta)
   deleted: (posted-at courier2 hamletc)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 49 to 52
   goals met: 5 of 12
22. (ride courier1 hamleta hamletc)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletc)
   changed: (toll) from 52 to 55
   goals met: 5 of 12
23. (grab scroll7 hamleta rightstrap2 courier2)
   deleted: (resting scroll7 hamleta) (idle rightstrap2)
   added: (held-in scroll7 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 55 to 57
   goals met: 5 of 12
24. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 57 to 60
   goals met: 5 of 12
25. (place scroll7 hamletb rightstrap2 courier2)
   deleted: (held-in scroll7 rightstrap2)
   added: (idle rightstrap2) (resting scroll7 hamletb)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 60 to 62
   goals met: 6 of 12
26. (place scroll1 hamletc leftstrap1 courier1)
   deleted: (held-in scroll1 leftstrap1)
   added: (idle leftstrap1) (resting scroll1 hamletc)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 62 to 64
   goals met: 7 of 12
27. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 64 to 67
   goals met: 7 of 12
28. (grab scroll8 hamleta rightstrap2 courier2)
   deleted: (resting scroll8 hamleta) (idle rightstrap2)
   added: (held-in scroll8 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 67 to 69
   goals met: 7 of 12
29. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 69 to 72
   goals met: 7 of 12
30. (place scroll8 hamletb rightstrap2 courier2)
   deleted: (held-in scroll8 rightstrap2)
   added: (idle rightstrap2) (resting scroll8 hamletb)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 72 to 74
   goals met: 8 of 12
31. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 74 to 77
   goals met: 8 of 12
32. (grab scroll9 hamleta rightstrap2 courier2)
   deleted: (resting scroll9 hamleta) (idle rightstrap2)
   added: (held-in scroll9 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 77 to 79
   goals met: 8 of 12
33. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 79 to 82
   goals met: 8 of 12
34. (place scroll9 hamletb rightstrap2 courier2)
   deleted: (held-in scroll9 rightstrap2)
   added: (idle rightstrap2) (resting scroll9 hamletb)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 82 to 84
   goals met: 9 of 12
35. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 84 to 87
   goals met: 9 of 12
36. (grab scroll10 hamleta rightstrap2 courier2)
   deleted: (resting scroll10 hamleta) (idle rightstrap2)
   added: (held-in scroll10 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 87 to 89
   goals met: 9 of 12
37. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 89 to 92
   goals met: 9 of 12
38. (place scroll10 hamletb rightstrap2 courier2)
   deleted: (held-in scroll10 rightstrap2)
   added: (idle rightstrap2) (resting scroll10 hamletb)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 92 to 94
   goals met: 10 of 12
39. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 94 to 97
   goals met: 10 of 12
40. (grab scroll11 hamleta rightstrap2 courier2)
   deleted: (resting scroll11 hamleta) (idle rightstrap2)
   added: (held-in scroll11 rightstrap2)
   changed: (current_pouch courier2) from 0 to 2, (toll) from 97 to 99
   goals met: 10 of 12
41. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 99 to 102
   goals met: 10 of 12
42. (place scroll11 hamletb rightstrap2 courier2)
   deleted: (held-in scroll11 rightstrap2)
   added: (idle rightstrap2) (resting scroll11 hamletb)
   changed: (current_pouch courier2) from 2 to 0, (toll) from 102 to 104
   goals met: 11 of 12
43. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 104 to 107
   goals met: 11 of 12
44. (grab scroll12 hamleta rightstrap2 courier2)
   deleted: (resting scroll12 hamleta) (idle rightstrap2)
   added: (held-in scroll12 rightstrap2)
   changed: (current_pouch courier2) from 0 to 2, (toll) from 107 to 109
   goals met: 11 of 12
45. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 109 to 112
   goals met: 11 of 12
46. (place scroll12 hamletb rightstrap2 courier2)
   deleted: (held-in scroll12 rightstrap2)
   added: (idle rightstrap2) (resting scroll12 hamletb)
   changed: (current_pouch courier2) from 2 to 0, (toll) from 112 to 114
   goals met: 12 of 12
